import React from 'react';
import { Card, BackTop } from 'antd'

class BackToTop extends React.Component {
  state = { };
  render() {
    return (
      <div style={{ padding: 24 }}>
        <Card bordered={false}>
            <BackTop />
            <h3>页面滚动到指定位置会在右下角出现返回顶部按钮</h3>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>
            <p> 这个人很懒，什么也没留下...</p>          
        </Card>
      </div>
    );
  }
}

export default BackToTop;